save in :thesis/results/
Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 128, 128, 3)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 126, 126, 64)      1792      
_________________________________________________________________
elu_15 (ELU)                 (None, 126, 126, 64)      0         
_________________________________________________________________
batch_normalization_15 (Batc (None, 126, 126, 64)      256       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 124, 124, 64)      36928     
_________________________________________________________________
elu_16 (ELU)                 (None, 124, 124, 64)      0         
_________________________________________________________________
batch_normalization_16 (Batc (None, 124, 124, 64)      256       
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 62, 62, 64)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 60, 60, 128)       73856     
_________________________________________________________________
elu_17 (ELU)                 (None, 60, 60, 128)       0         
_________________________________________________________________
batch_normalization_17 (Batc (None, 60, 60, 128)       512       
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 58, 58, 128)       147584    
_________________________________________________________________
elu_18 (ELU)                 (None, 58, 58, 128)       0         
_________________________________________________________________
batch_normalization_18 (Batc (None, 58, 58, 128)       512       
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 29, 29, 128)       0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 27, 27, 256)       295168    
_________________________________________________________________
elu_19 (ELU)                 (None, 27, 27, 256)       0         
_________________________________________________________________
batch_normalization_19 (Batc (None, 27, 27, 256)       1024      
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 25, 25, 256)       590080    
_________________________________________________________________
elu_20 (ELU)                 (None, 25, 25, 256)       0         
_________________________________________________________________
batch_normalization_20 (Batc (None, 25, 25, 256)       1024      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 12, 12, 256)       0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 36864)             0         
_________________________________________________________________
dense_5 (Dense)              (None, 2048)              75499520  
_________________________________________________________________
elu_21 (ELU)                 (None, 2048)              0         
_________________________________________________________________
batch_normalization_21 (Batc (None, 2048)              8192      
_________________________________________________________________
dropout_3 (Dropout)          (None, 2048)              0         
_________________________________________________________________
dense_6 (Dense)              (None, 8)                 16392     
=================================================================
Total params: 76,673,096
Trainable params: 76,667,208
Non-trainable params: 5,888